In [6]:
# R Missing values
# In R the missing values are coded by the symbol NA
Name <- c("Sachin", "Kohli", NA,"Mithali")
Sex <- c("men", "men", "women","women")
Age <- c(45, 33, NA,33)
dt <- data.frame(Name, Sex, Age)
dt

  Name    Sex   Age
1 Sachin  men   45
2 Kohli   men   33
3 NA      women NA
4 Mithali women 33

In [2]:
is.na(dt)

     Name  Sex   Age
[1,] FALSE FALSE FALSE
[2,] FALSE FALSE FALSE
[3,]  TRUE FALSE  TRUE
[4,] FALSE FALSE FALSE

In [4]:
# how much and how many are missing
sum(is.na(dt))
mean(is.na(dt))

[1] 2

[1] 0.1666667

In [5]:
na.omit(dt)  # only cleaned data

  Name    Sex   Age
1 Sachin  men   45
2 Kohli   men   33
4 Mithali women 33

In [7]:
# list rows of data that have missing values 
dt[!complete.cases(dt),]

  Name Sex   Age
3 NA   women NA

In [8]:
x <- dt$Age
mean(x) # returns NA
mean(x, na.rm=TRUE) # returns 2

[1] NA

[1] 37